In [1]:
import pandas as pd
import numpy as np
import sys
sys.path.insert(0, '/Users/Onur/repos/toolbox/')
from plot_helpers import *
%matplotlib inline

In [2]:
df = pd.read_csv('./train.csv')

In [3]:
df.shape

(891, 12)

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [6]:
titles = df['Name'].str.extract(', (.*?)\. ')
df.loc[df.index, 'Title'] = titles
df.head()

/Users/Onur/anaconda/lib/python2.7/site-packages/ipykernel/__main__.py:1: FutureWarning: currently extract(expand=None) means expand=False (return Index/Series/DataFrame) but in a future version of pandas this will be changed to expand=True (return DataFrame)
  if __name__ == '__main__':

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Mrs
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Mr

In [7]:
def mf_code(x):
    if x == 'male':
        return 0
    elif x == 'female':
        return 1
    else:
        return np.nan
df.loc[df.index, 'Sex'] = df['Sex'].apply(mf_code)

In [8]:
title_list = df['Title'].unique().tolist()
for i, title in enumerate(title_list):
    change_idx = df[df['Title'] == title].index
    df.loc[change_idx, 'Title_code'] = i

In [9]:
embark = df['Embarked'].unique()
for i, e in enumerate(embark):
    change_idx = df[df['Embarked'] == e].index
    df.loc[change_idx, 'Embarked_code'] = i

In [10]:
train_df = df.copy()
df.drop('Embarked', axis=1, inplace=True)
df.drop('Title', axis=1, inplace=True)
df.drop('Name', axis=1, inplace=True)
df.drop(['Cabin', 'Ticket'], axis=1, inplace=True)
df.dropna(inplace=True)

In [11]:
test_df = pd.read_csv('./test.csv')
test_df.drop(['Cabin', 'Ticket'], axis=1, inplace=True)
test_df.loc[test_df.index, 'Sex'] = test_df['Sex'].apply(mf_code)
titles = test_df['Name'].str.extract(', (.*?)\. ')
test_df.loc[test_df.index, 'Title'] = titles
for i, title in enumerate(title_list):
    change_idx = test_df[test_df['Title'] == title].index
    test_df.loc[change_idx, 'Title_code'] = i
for i, e in enumerate(embark):
    change_idx = test_df[test_df['Embarked'] == e].index
    test_df.loc[change_idx, 'Embarked_code'] = i

/Users/Onur/anaconda/lib/python2.7/site-packages/ipykernel/__main__.py:4: FutureWarning: currently extract(expand=None) means expand=False (return Index/Series/DataFrame) but in a future version of pandas this will be changed to expand=True (return DataFrame)

# fix the nans in the testing set so they can get predicted
Try to use median value of similar passengers

In [13]:
test_df[pd.isnull(test_df['Fare'])]

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Title,Title_code,Embarked_code
152,1044,3,"Storey, Mr. Thomas",0,60.5,0,0,NaN,S,Mr,0.0,0.0

In [14]:
a = test_df[(test_df['Pclass'] == 3) & (test_df['Embarked'] == 'S') & (test_df['SibSp'] == 0) & (test_df['Parch'] ==0)]
print a['Fare'].median()
test_df.loc[152, 'Fare'] = a['Fare'].median()

7.8958

In [15]:
test_df[pd.isnull(test_df['Title_code'])]

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Title,Title_code,Embarked_code
414,1306,1,"Oliva y Ocana, Dona. Fermina",1,39.0,0,0,108.9,C,Dona,NaN,1.0

In [12]:
a = test_df[(test_df['Pclass'] == 1) & (test_df['Embarked'] == 'C')]
train_df[train_df['Name'].str.contains('Don')]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title,Title_code,Embarked_code
30,31,0,1,"Uruchurtu, Don. Manuel E",0,40.0,0,0,PC 17601,27.7208,NaN,C,Don,4.0,1.0
544,545,0,1,"Douglas, Mr. Walter Donald",0,50.0,1,0,PC 17761,106.4250,C86,C,Mr,0.0,1.0

In [16]:
test_df.loc[414, 'Title_code'] = 4.0

In [17]:
test_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
PassengerId      418 non-null int64
Pclass           418 non-null int64
Name             418 non-null object
Sex              418 non-null int64
Age              332 non-null float64
SibSp            418 non-null int64
Parch            418 non-null int64
Fare             418 non-null float64
Embarked         418 non-null object
Title            418 non-null object
Title_code       418 non-null float64
Embarked_code    418 non-null float64
dtypes: float64(4), int64(5), object(3)
memory usage: 39.3+ KB

In [99]:
test_df = test_df[df.columns[~df.columns.str.contains('Survived')]]

In [101]:
data = {
    'Title_code': title_list,
    'Embarked_code': embark,
    'Sex_code': ['male', 'female'],
    'train_data': df,
    'test_data': test_df
}

In [103]:
import pickle
with open('./cleaned_data.pkl', 'w') as f:
    pickle.dump(data, f)